; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l19_p19_c19_g19_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(person-at person1 loc11)
	(person-at person2 loc10)
	(person-at person3 loc16)
	(person-at person4 loc5)
	(person-at person5 loc13)
	(person-at person6 loc19)
	(person-at person7 loc6)
	(person-at person8 loc11)
	(person-at person9 loc17)
	(person-at person10 loc8)
	(person-at person11 loc15)
	(person-at person12 loc7)
	(person-at person13 loc1)
	(person-at person14 loc8)
	(person-at person15 loc15)
	(person-at person16 loc11)
	(person-at person17 loc8)
	(person-at person18 loc17)
	(person-at person19 loc12)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person12 food)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person14 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
))
)

; plan
1. (put-crate-in-carrier crate19 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate19 depot)
   added: (crate-at-space crate19 carrier1 space4)
   goals met: 1 of 20
2. (put-crate-in-carrier crate15 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space3)
   goals met: 1 of 20
3. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 0 of 20
4. (pick-and-drop crate15 loc19 drone1 carrier1 space3 person6 food)
   deleted: (crate-at-space crate15 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person6 food)
   goals met: 1 of 20
5. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 20
6. (put-crate-in-carrier crate14 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space3)
   goals met: 2 of 20
7. (move-carrier depot loc16 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   goals met: 1 of 20
8. (pick-and-drop crate14 loc16 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate14 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 2 of 20
9. (move-carrier loc16 depot drone1 carrier1)
   deleted: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 20
10. (put-crate-in-carrier crate13 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space3)
   goals met: 3 of 20
11. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 2 of 20
12. (pick-and-drop crate13 loc13 drone1 carrier1 space3 person5 food)
   deleted: (crate-at-space crate13 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person5 food)
   goals met: 3 of 20
13. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 20
14. (put-crate-in-carrier crate12 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space3)
   goals met: 4 of 20
15. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 3 of 20
16. (pick-and-drop crate12 loc12 drone1 carrier1 space3 person19 food)
   deleted: (crate-at-space crate12 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person19 food)
   goals met: 4 of 20
17. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 20
18. (put-crate-in-carrier crate11 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space3)
   goals met: 5 of 20
19. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 4 of 20
20. (pick-and-drop crate11 loc11 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate11 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 5 of 20
21. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 20
22. (put-crate-in-carrier crate10 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space3)
   goals met: 6 of 20
23. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 5 of 20
24. (pick-and-drop crate10 loc6 drone1 carrier1 space3 person7 food)
   deleted: (crate-at-space crate10 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person7 food)
   goals met: 6 of 20
25. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 20
26. (put-crate-in-carrier crate9 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space3)
   goals met: 7 of 20
27. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 6 of 20
28. (pick-and-drop crate9 loc5 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate9 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 7 of 20
29. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 20
30. (put-crate-in-carrier crate8 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space3)
   goals met: 8 of 20
31. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 7 of 20
32. (pick-and-drop crate8 loc1 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate8 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 8 of 20
33. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 20
34. (put-crate-in-carrier crate7 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space3)
   goals met: 9 of 20
35. (put-crate-in-carrier crate18 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space2)
   goals met: 9 of 20
36. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 8 of 20
37. (pick-and-drop crate18 loc15 drone1 carrier1 space2 person11 medicine)
   deleted: (crate-at-space crate18 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person11 medicine)
   goals met: 9 of 20
38. (pick-and-drop crate7 loc15 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate7 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 10 of 20
39. (pick-and-drop crate19 loc15 drone1 carrier1 space4 person15 medicine)
   deleted: (crate-at-space crate19 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person15 medicine)
   goals met: 11 of 20
40. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 20
41. (put-crate-in-carrier crate17 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space4)
   goals met: 12 of 20
42. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 12 of 20
43. (put-crate-in-carrier crate16 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space2)
   goals met: 12 of 20
44. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 11 of 20
45. (pick-and-drop crate16 loc8 drone1 carrier1 space2 person10 medicine)
   deleted: (crate-at-space crate16 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person10 medicine)
   goals met: 12 of 20
46. (move-carrier loc8 loc7 drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 12 of 20
47. (pick-and-drop crate17 loc7 drone1 carrier1 space4 person12 medicine)
   deleted: (crate-at-space crate17 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person12 medicine)
   goals met: 13 of 20
48. (pick-and-drop crate6 loc7 drone1 carrier1 space3 person12 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person12 food)
   goals met: 14 of 20
49. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 20
50. (put-crate-in-carrier crate5 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space4)
   goals met: 15 of 20
51. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 15 of 20
52. (move-carrier depot loc17 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   goals met: 14 of 20
53. (pick-and-drop crate4 loc17 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 15 of 20
54. (pick-and-drop crate5 loc17 drone1 carrier1 space4 person18 food)
   deleted: (crate-at-space crate5 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person18 food)
   goals met: 16 of 20
55. (move-carrier loc17 depot drone1 carrier1)
   deleted: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 20
56. (put-crate-in-carrier crate3 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space4)
   goals met: 17 of 20
57. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 17 of 20
58. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 16 of 20
59. (pick-and-drop crate2 loc8 drone1 carrier1 space3 person10 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person10 food)
   goals met: 17 of 20
60. (pick-and-drop crate3 loc8 drone1 carrier1 space4 person14 food)
   deleted: (crate-at-space crate3 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person14 food)
   goals met: 18 of 20
61. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 20
62. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 19 of 20
63. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 18 of 20
64. (pick-and-drop crate1 loc8 drone1 carrier1 space4 person17 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person17 food)
   goals met: 19 of 20
65. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 20 of 20
